<template lang="pug">
svg(viewBox="0 0 1060 685.3")
  a(class="part" v-for = "item in items" v-bind:class="{'active': item.isActive}")
    path( :d="item.d" fill="crimson") 
</template>

<script>

export default {
  name: 'Parts',

  data () {
    return {
      isActive: false,
      items: [
        {
          d: 'm 401.44089,78.551818 c 20.37105,73.197402 41.95097,146.697012 41.06812,214.580932 60.71165,3.28617 120.28633,7.70931 175.56622,16.42725 22.17227,-61.28913 13.50835,-134.91274 -5.13352,-212.527527 z',
          id: 0,
          name: 'СТЕЙК ФИЛЕ МИНЬОН',
          desc: 'Это самое нежное мясо для стейка. Проходит влажное созревание от 5 до 10 дней. Для ресторанов и торговых сетей поставляется отрубом в вакумной упаковке.',
          longDesc: 'Изготавливается из самой ценной части говядины — тендерлоина (вырезки). Небольшой мышцы, которая практически не задействована в движениях животного. Мы рекомендуем готовить Тендерлоин стейки от Medium Rare до Medium, недолго обжаривая на сковороде и доводя до готовности в духовке.',
          price: '450 ГРН.',
          photo: 'static/img/steak1.png',
          showCard: false,
          class: 'part1'
        },
        { d: 'm 290.39547,87.118641 c 15.76519,64.232279 25.83321,131.313139 26.13559,203.276829 l 127.77401,8.71187 -5.80791,-40.65537 -17.42373,-98.73446 -20.32768,-78.406778 z',
          id: 1,
          name: 'СТЕЙК ТОМАГАВК СУХОЙ ФЕРМЕНТАЦИИ',
          desc: 'Томагавк - стейк для мужчин с заниженной реберной костью бычка. Сухое созревание 42 дня',
          longDesc: 'Классический стейк – это это кусок говядины, нарезанный поперек волокон. Такой способ нарезки делается для равномерного прохождения жара через вертикально расположенные волокна. Обычная говядина для приготовления стейков не подходит. Чтобы стейк получился сочным и мягким нужны специальные, мраморные сорта мяса.',
          price: '430 ГРН',
          photo: 'static/img/steak2.png',
          showCard: false,
          class: 'part2'
        },
        {
          d: 'm 283.37004,430.19761 23.10081,-61.08884 9.24033,-45.17493 0.81988,-33.53837 65.40247,1.71058 62.37154,7.00129 -5.38952,36.12024 -4.62017,40.04142 -4.62016,33.8812 -22.58747,-9.75368 -28.74768,-2.05341 -18.48066,4.10681 -15.91389,6.67357 -16.9406,10.78038 -12.83379,11.80709 -30.80109,-0.51335',
          id: 2,
          name: 'СТЕЙК ТИ-БОН',
          desc: 'Этот стейк влажного созревания, он как и Портерхаус имеет Т-образную кость, которая делит стейк между вырезкой и тонким краем филейной части, которой меньше в Портерхаусе.',
          longDesc: 'Стейк ти-бон очень похож на портерхаус. Он такой же тяжелый (450 г.) и сытный, но в нем часть вырезки меньше, чем в портерхаусе, т.к. ти-бон вырезается ближе к передней части туши, где отруб вырезки сужается. Подготовлен методом традиционного созревания без применения искусственных консервантов, ускорителей созревания и улучшителей вкуса.',
          price: '320 ГРН',
          photo: 'static/img/steak3.png',
          showCard: false,
          class: 'part3'
        },
        {
          d: 'm 314.17113,430.71096 12.83379,25.66758 13.86049,36.96131 9.24033,29.26103 9.24032,18.48066 41.06812,11.80708 2.56676,-22.07411 8.72698,-21.04742 8.21362,-21.04741 5.13352,-17.9673 5.13351,-20.53406 3.08011,-23.10082 -3.59346,-17.9673 -39.01471,-10.78039 -30.8011,3.08011 z',
          id: 3,
          name: 'СТЕЙК НЬЮ-ЙОРК (СТРИПЛОЙН)',
          desc: 'Этот стейк для истинных ценителей мяса. В нем нет жировых прослоек, он более постный.',
          longDesc: 'Стейк НЬЮ-ЙОРК (СТРИПЛОЙН) – кусок мякоти говяжьего мяса толщиной 3,5 – 4 см, весом 250 гр. или цельный кусок, вырезанный из тонкого края битка бычка (не старше двух лет) отечественных пород КРС. Подготовлен методом традиционного созревания без применения искусственных консервантов, ускорителей созревания и улучшителей вкуса. Возможна ароматизация специальным сбором натуральных специй.',
          price: '250 ГРН',
          photo: 'static/img/steak4.png',
          showCard: false,
          class: 'part4'
        },
        {
          d: 'm 445.58912,293.13275 57.49537,5.13352 39.52807,1.0267 29.26103,2.05341 26.69428,1.54005 20.53406,4.62017 -6.16022,16.42724 -5.64686,20.02071 -7.18692,20.53406 -3.08011,14.8872 -1.54006,12.32043 -0.51335,16.42725 v 16.9406 l 2.05341,21.56077 -3.08011,7.18692 -19.50736,-9.75368 -20.02071,-4.10681 -24.64087,-1.54006 -26.69428,-1.0267 -24.12752,3.59346 -25.66758,5.13352 -14.88719,3.59346 -8.21363,0.51335 4.10681,-17.96731 -1.0267,-5.13351 -3.59346,-17.9673 4.10681,-28.23434 3.08011,-18.994 3.08011,-23.61417 z',
          id: 4,
          name: 'СТЕЙК РИБАЙ ПРЕМИУМ',
          desc: 'Это самое лучшее мясо для стейка. В нем достаточно жировых прослоек и реберная кость, которая дает особый вкус мясу.',
          longDesc: 'Рибай – универсальный стейк: его можно приготовить дома на сковороде и подать как деликатесное блюдо, а можно зажарить на углях и съесть на пикнике, сидя на траве. Стейк рибай – это классика, обязательный атрибут хорошего мясного ресторана. Подготовлен методом традиционного созревания без применения искусственных консервантов, ускорителей созревания и улучшителей вкуса.',
          price: '315 ГРН',
          photo: 'static/img/steak5.png',
          showCard: false,
          class: 'part5'
        },
        {
          d: 'm 609.8616,95.492418 8.72698,24.640872 4.62016,17.45395 5.13352,20.53406 0.51335,24.12752 2.56676,22.07412 -0.51335,15.9139 -1.02671,20.02071 -3.08011,25.15422 -4.10681,23.61417 -3.59346,18.48066 10.78038,3.0801 17.96731,3.08011 16.42725,3.08011 24.64087,7.18692 22.58746,8.72698 15.40055,3.59346 4.10681,-16.9406 5.13352,-22.58747 6.67357,-29.26103 3.08011,-20.53406 4.62016,-17.96731 v -23.10082 l -2.05341,-25.15422 -2.0534,-24.12752 -4.62017,-24.64087 -4.62016,-22.58747 -6.67357,-21.047413 -15.40054,0.513351 -26.18093,0.513352 -18.99401,3.59346 -17.45395,1.026703 z',
          id: 5,
          name: 'СТЕЙК ОССОБУКО',
          desc: 'Имеет насыщенный говяжий аромат. Идеален для тушения, для приготовления Оссо Буко.',
          longDesc: 'Главная особенность нарезки стейка оссобуко — получение кости по центру стейка — «дырявая кость», что послужило не только его названию, но и приятной сочности всех полученных из него блюд. Благодаря своему итальянскому происхождению, оссобуко предпочитают подавать именно с такими итальянскими блюдами, как ризотто.',
          price: '170 ГРН',
          photo: 'static/img/steak6.png',
          showCard: false,
          class: 'part6'
        },
        {
          d: 'm 593.94771,453.81178 14.88719,15.40054 14.37384,12.83379 10.26703,5.13352 3.59346,-14.8872 9.75368,-9.24032 8.72698,-8.72698 11.80708,-6.16022 20.02071,-8.72697 19.50736,-4.62017 20.53406,-8.21362 24.12752,-10.78038 15.9139,-9.75368 18.48066,-6.16022 13.34713,-5.64687 16.9406,-4.10681 7.18693,-1.54005 -12.83379,-11.80709 -22.58747,-14.37384 -24.64087,-11.29374 -21.04741,-8.21362 -20.53406,-8.72698 -22.58747,-7.70027 -34.39455,-11.80708 -22.58747,-2.05341 -23.10082,-5.13351 -6.16022,16.42724 -7.70027,25.66758 -5.13351,14.88719 -4.62017,27.20763 -0.51335,20.02071 1.54005,22.58747 z',
          id: 6,
          name: 'СТЕЙК ПОРТЕРХАУС СУХОЙ ФЕРМЕНТАЦИИ',
          desc: 'Мясо находится до 38 дней в особых условиях, охлажденных потоках воздуха.',
          longDesc: 'Портерхаус — самый большой и сытный стейк из поясничной части. Словом porterhouse в XVIII веке назывались посещаемые грузчиками лондонского рынка Ковент-Гарден дешевые пивные и таверны, где в почете было темное пиво портер. Колонисты привезли привычное название в Новый Свет и со временем стали называть портерхаусами рестораны, где подавали не только пиво, но и мясо.',
          price: '440 ГРН',
          photo: 'static/img/steak7.png',
          showCard: false,
          class: 'part7'
        },
        {
          d: 'm 732.03927,87.278794 8.21362,36.961306 5.13352,29.26104 5.13351,24.64087 v 24.12752 l -1.54005,25.66758 -3.08011,23.61417 -6.67357,30.80109 -5.13352,20.53406 -3.08011,17.9673 -3.59346,13.34714 17.45395,9.24033 14.37385,5.13352 21.56076,8.72697 17.45395,10.78038 17.45395,11.29374 7.70028,9.24033 10.78038,2.56675 5.64686,4.10681 5.64687,-9.24032 4.62016,-22.07412 3.59347,-12.32043 5.13351,-22.58747 6.16022,-34.39455 5.13351,-31.31445 1.54006,-26.69427 2.56676,-26.69428 -1.54006,-21.56077 -2.0534,-22.58746 -6.67357,-25.15423 -7.18693,-21.56076 -9.24032,-19.50736 -7.70028,-11.807085 -10.26703,-13.347139 -16.42724,1.540054 -13.8605,4.106812 -16.9406,1.026704 -16.42724,2.053406 z',
          id: 7,
          name: 'СТЕЙК КОВБОЙ',
          desc: 'Это стейк для настоящего мужчины',
          longDesc: 'Стейк «Ковбой» может быть приготовлен только из отборной говядины специального смешанного откорма, то есть из мраморного мяса. Это очень крупный стейк вес которого может колебаться от 500 грамм до 1 килограмма в зависимости от размера бычка. И, конечно, в первую очередь по этой причине, он считается истинно мужским стейком.',
          price: '300 ГРН',
          photo: 'static/img/steak8.png',
          showCard: false,
          class: 'part8'
        },
        {
          d: 'm 829.57605,74.445006 18.99401,-8.213625 15.40055,-6.160218 22.07411,2.566758 20.53406,-1.026703 20.02071,1.026703 17.45395,1.540054 12.32044,5.646867 11.29373,6.67357 7.70028,10.780382 12.32043,17.453956 8.21363,13.34713 11.29375,18.99401 9.2403,18.48066 5.1335,19.50735 5.1335,20.02071 -0.5133,22.07412 -1.0267,20.53406 -5.1335,23.10082 -5.1335,18.994 -5.1336,22.07412 -9.2403,25.66757 -5.13351,23.61417 -6.16021,21.04742 -6.67357,24.12752 -3.08011,5.64686 -17.45395,-8.72697 -24.64088,-8.72698 -20.53406,-7.18692 -25.15422,-3.59346 -18.48066,2.05341 -12.32043,4.10681 -15.40055,6.16022 4.62016,-22.07412 7.18693,-24.64087 6.67357,-31.31444 5.64686,-35.93461 2.56676,-33.36785 2.05341,-47.74169 -2.56676,-13.86049 -3.59346,-25.66758 -7.18692,-21.04741 -6.16022,-17.45395 -7.18692,-13.34714 z',
          id: 8,
          name: 'СТЕЙК МЯСНИКА',
          desc: 'Этот стейк очень сильно отличается от других видов стейков. Многие считают его стейком с самым ярким вкусом говядины. И каждый его кусочек имеет необыкновенный вкус.',
          longDesc: 'СВкус стейка отличается от классических стейков интенсивностью, а благодаря необычной текстуре он остается сочным даже при высокой степени прожарки. Большой вес стейка, яркий вкус и оригинальная форма превратили Мачете в брутальный мужской атрибут.',
          price: '190 ГРН',
          photo: 'static/img/steak9.png',
          showCard: false,
          class: 'part9'
        },
        {
          d: 'm 839.84308,395.2897 12.83379,15.9139 5.13352,11.29374 4.10681,13.86049 4.62016,15.40054 6.16022,16.9406 7.18692,15.40055 8.21363,13.34714 4.62016,9.24032 6.67357,8.21363 7.18692,9.75368 4.10681,11.29373 3.08011,8.72698 13.86049,-0.51335 16.9406,-2.56676 13.34714,-1.54006 12.83379,2.05341 4.62017,-11.29373 6.67357,-20.02071 6.67356,-9.75368 1.54006,-12.32044 -1.0267,-10.78038 -6.67357,-7.18692 -7.70028,-13.34714 -1.54005,-12.32044 1.54005,-11.29373 2.56676,-14.8872 3.08011,-11.80708 -1.0267,-5.13352 -17.45395,-8.72697 -17.96731,-5.64687 -16.9406,-5.13351 -15.91389,-5.13352 -12.32044,-1.54005 -14.37384,0.51335 -11.29374,-0.51335 -13.34714,5.13351 -9.24032,3.08011 z',
          id: 3,
          name: 'СТЕЙК НЬЮ-ЙОРК (СТРИПЛОЙН)',
          desc: 'Этот стейк для истинных ценителей мяса. В нем нет жировых прослоек, он более постный.',
          longDesc: 'Стейк НЬЮ-ЙОРК (СТРИПЛОЙН) – кусок мякоти говяжьего мяса толщиной 3,5 – 4 см, весом 250 гр. или цельный кусок, вырезанный из тонкого края битка бычка (не старше двух лет) отечественных пород КРС. Подготовлен методом традиционного созревания без применения искусственных консервантов, ускорителей созревания и улучшителей вкуса. Возможна ароматизация специальным сбором натуральных специй.',
          price: '250 ГРН',
          photo: 'static/img/steak4.png',
          showCard: false,
          class: 'part4'
        }
      ]
    }
  },

  methods: {
    selectPart (item, index) {
      if (index) {
        item = item.isActive
      } else return
      console.log(index)
      console.log(this.items[index].id)
    }
  }
}
</script>

<style lang="scss" scoped>

svg {
 position: absolute;
 top: 0;
 left: 0;
 height: 100%;
 width: 100%;
}

.part {
 opacity: 0;
 cursor: pointer;
 transition: all 0.2s ease-in-out;

 &:hover {
  opacity: .4;
 }

 &.active {
  opacity: .7;
  border: 1px solid black;
 }
}

</style>
